<?php 

echo 'hello';
echo "Hi, ZEKA";

echo 'OK';


echo 'Codeigniter-это фреймворк разработки приложений - инструментарий - для тех, кто создает веб-сайты с помощью PHP. Его цель-позволить вам разрабатывать проекты гораздо быстрее, чем вы могли б если бы вы писали код с нуля, предоставляя богатый набор библиотек для часто используемых задач, а также простой интерфейс и логическую структуру для доступа к этим библиотекам. Сodeigniter позволяет творчески сосредоточиться на вашем проекте, минимизируя количество кода, необходимого для данной задачи.

Для кого предназначен CodeIgniter?
Codeigniter для вас, если:';

