<?php 

echo 'hello';
echo "Hi, ZEKA";

echo 'OK';


echo 'Codeigniter-это фреймворк разработки приложений - инструментарий - для тех, кто создает веб-сайты с помощью PHP. Его цель-позволить вам разрабатывать проекты гораздо быстрее, чем вы могли б если бы вы писали код с нуля, предоставляя богатый набор библиотек для часто используемых задач, а также простой интерфейс и логическую структуру для доступа к этим библиотекам. Сodeigniter позволяет творчески сосредоточиться на вашем проекте, минимизируя количество кода, необходимого для данной задачи.

Для кого предназначен CodeIgniter?
Codeigniter для вас, если:

Вы хотите фреймворк, с малой частью присутствия.
Вам нужна исключительная производительность.
Вам нужна широкая совместимость со стандартными хостинг-аккаунтами, на которых работают различные версии PHP и конфигурации.
Вы хотите фреймворк, который почти не требуется настраивать.
Вы хотите фреймворк, который не требует использования командной строки.
Вы хотите фреймворк, который не требует от вас придерживания строгих правил кодирования.
Вы не заинтересованы в масштабных монолитных библиотек, как PEAR.
Вы не хотите быть вынуждены изучать язык шаблонов (хотя шаблон парсера опционально доступен если вы решите его использовать).
Вы отказываетесь от  сложностей, в пользу простых решений.
Вам нужно понятная, тщательно подготовленая документация.';

